Revit 2026 API

# ScheduleSortGroupFieldShowFooterCount Property

---

Indicates if the footer row should display a count of elements in the group.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ShowFooterCount { get; set; }
```
```vb
Public Property ShowFooterCount As Boolean
	Get
	Set
```
```cpp
public:
property bool ShowFooterCount {
	bool get ();
	void set (bool value);
}
```
```fsharp
member ShowFooterCount : bool with get, set
```

#### Property Value

Boolean True if an element count should be displayed, false otherwise.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: Display of footer rows is not enabled. |

ShowFooterCount can only be enabled if ShowFooter is enabled.

#### Reference

ScheduleSortGroupField Class

Autodesk.Revit.DB Namespace